In [88]:
import mysql.connector
import pandas as pd

In [89]:
#Koneksi ke database
mydb = mysql.connector.connect(
host = 'localhost',
user = 'root',
passwd = '****',
database = 'sakila')

In [90]:
#fungsi
kursor = mydb.cursor()
def sql(query) :
    kursor.execute(query)
    hasil = kursor.fetchall()
    data = pd.DataFrame(data = hasil, columns = kursor.column_names)
    return data

In [44]:
sql('select * from film')

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"{Behind the Scenes, Deleted Scenes}",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"{Trailers, Deleted Scenes}",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,None,7,2.99,50,18.99,NC-17,"{Trailers, Deleted Scenes}",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,None,5,2.99,117,26.99,G,"{Behind the Scenes, Commentaries}",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,None,6,2.99,130,22.99,G,{Deleted Scenes},2006-02-15 05:03:42
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,YOUNG LANGUAGE,A Unbelieveable Yarn of a Boat And a Database ...,2006,1,None,6,0.99,183,9.99,G,"{Behind the Scenes, Trailers}",2006-02-15 05:03:42
996,997,YOUTH KICK,A Touching Drama of a Teacher And a Cat who mu...,2006,1,None,4,0.99,179,14.99,NC-17,"{Behind the Scenes, Trailers}",2006-02-15 05:03:42
997,998,ZHIVAGO CORE,A Fateful Yarn of a Composer And a Man who mus...,2006,1,None,6,0.99,105,10.99,NC-17,{Deleted Scenes},2006-02-15 05:03:42
998,999,ZOOLANDER FICTION,A Fateful Reflection of a Waitress And a Boat ...,2006,1,None,5,2.99,101,28.99,R,"{Trailers, Deleted Scenes}",2006-02-15 05:03:42
999,1000,ZORRO ARK,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,None,3,4.99,50,18.99,NC-17,"{Behind the Scenes, Trailers, Commentaries}",2006-02-15 05:03:42

In [25]:
# menampilkan film_id dan rental durasinya, di mana rental durasi filmnya di atas rata-rata durasi semua film
#subquery
sql('''
select film_id, rental_duration from film
where length > (select avg(rental_duration) from film)
order by rental_duration desc
limit 5
 ''')

   film_id  rental_duration
0       70                7
1       36                7
2        3                7
3       27                7
4       78                7

In [31]:
#CTE
sql(''' 
WITH rata_durasi AS(
SELECT AVG(rental_duration) as avg_durasi
from film
)

select film_id, rental_duration from film
where rental_duration> (select avg_durasi from rata_durasi)
order by 2 desc
limit 5
''')

   film_id  rental_duration
0        3                7
1       27                7
2       70                7
3       36                7
4       78                7

In [30]:
#kita bisa membuat lebih dari 1 CTE
sql(''' 
WITH rata_durasi AS(
    SELECT AVG(rental_duration) as avg_durasi
    from film),
rata_lama as(
    select avg(length) as avg_length
    from film
)
select title, length, rental_duration from film
where rental_duration > (select avg_durasi from rata_durasi) and
length <(select avg_length from rata_lama)

''')

                 title  length  rental_duration
0     ACADEMY DINOSAUR      86                6
1     ADAPTATION HOLES      50                7
2      AIRPLANE SIERRA      62                6
3      AIRPORT POLLOCK      54                6
4     ALADDIN CALENDAR      63                6
..                 ...     ...              ...
288          WONKA SEA      85                6
289      WYOMING STORM     100                6
290        YENTL IDAHO      86                5
291       ZHIVAGO CORE     105                6
292  ZOOLANDER FICTION     101                5

[293 rows x 3 columns]

In [35]:
# CTE bisa dipakai berkali-kali dalam 1 statement
sql(''' 
with rata_panjang as(
    select rating, avg(length) as avg_length
    from film
    group by 1
)

select title, length from film
where length between (select avg_length from rata_panjang where rating='G') and (select avg_length from rata_panjang where rating='pg-13')
''')

                   title  length
0       AFFAIR PREJUDICE     117
1          ALABAMA DEVIL     114
2           AMADEUS HOLY     113
3   APOCALYPSE FLAMINGOS     119
4           ATTACKS HATE     113
..                   ...     ...
65        TROOPERS METAL     115
66  UNTOUCHABLES SUNRISE     120
67            WAIT CIDER     112
68    WATERSHIP FRONTIER     112
69          WORDS HUNTER     116

[70 rows x 2 columns]

In [103]:
#Koneksi ke database
mydb = mysql.connector.connect(
host = 'localhost',
user = 'root',
passwd = '*****',
database = 'world')

In [106]:
#fungsi
kursor = mydb.cursor()
def sql(query) :
    kursor.execute(query)
    hasil = kursor.fetchall()
    data = pd.DataFrame(data = hasil, columns = kursor.column_names)
    return data

In [107]:
sql('select * from country')

,Code,Name,Continent,Region,SurfaceArea,IndepYear,Population,LifeExpectancy,GNP,GNPOld,LocalName,GovernmentForm,HeadOfState,Capital,Code2
0,ABW,Aruba,North America,Caribbean,193.0,NaN,103000,78.4,828.0,793.0,Aruba,Nonmetropolitan Territory of The Netherlands,Beatrix,129.0,AW
1,AFG,Afghanistan,Asia,Southern and Central Asia,652090.0,1919.0,22720000,45.9,5976.0,NaN,Afganistan/Afqanestan,Islamic Emirate,Mohammad Omar,1.0,AF
2,AGO,Angola,Africa,Central Africa,1246700.0,1975.0,12878000,38.3,6648.0,7984.0,Angola,Republic,JosÃ© Eduardo dos Santos,56.0,AO
3,AIA,Anguilla,North America,Caribbean,96.0,NaN,8000,76.1,63.2,NaN,Anguilla,Dependent Territory of the UK,Elisabeth II,62.0,AI
4,ALB,Albania,Europe,Southern Europe,28748.0,1912.0,3401200,71.6,3205.0,2500.0,ShqipÃ«ria,Republic,Rexhep Mejdani,34.0,AL
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
234,YEM,Yemen,Asia,Middle East,527968.0,1918.0,18112000,59.8,6041.0,5729.0,Al-Yaman,Republic,Ali Abdallah Salih,1780.0,YE
235,YUG,Yugoslavia,Europe,Southern Europe,102173.0,1918.0,10640000,72.4,17000.0,NaN,Jugoslavija,Federal Republic,Vojislav KoÂštunica,1792.0,YU
236,ZAF,South Africa,Africa,Southern Africa,1221037.0,1910.0,40377000,51.1,116729.0,129092.0,South Africa,Republic,Thabo Mbeki,716.0,ZA
237,ZMB,Zambia,Africa,Eastern Africa,752618.0,1964.0,9169000,37.2,3377.0,3922.0,Zambia,Republic,Frederick Chiluba,3162.0,ZM
238,ZWE,Zimbabwe,Africa,Eastern Africa,390757.0,1980.0,11669000,37.8,5951.0,8670.0,Zimbabwe,Republic,Robert G. Mugabe,4068.0,ZW

In [50]:
#tanpa over()
sql('select avg(population) from country')

  avg(population)
0   25434098.1172

In [52]:
#dengan over()
#Perhatikan isi kolom rata populasi
sql(''' 
select name, population, avg(population) over () as rata_populasi
from country
''')

             name  population  rata_populasi
0           Aruba      103000  25434098.1172
1     Afghanistan    22720000  25434098.1172
2          Angola    12878000  25434098.1172
3        Anguilla        8000  25434098.1172
4         Albania     3401200  25434098.1172
..            ...         ...            ...
234         Yemen    18112000  25434098.1172
235    Yugoslavia    10640000  25434098.1172
236  South Africa    40377000  25434098.1172
237        Zambia     9169000  25434098.1172
238      Zimbabwe    11669000  25434098.1172

[239 rows x 3 columns]

In [53]:
#contoh penggunaan over: mencari selisih populasi suatu negara dengan rata-rata populasi dunia 

sql(''' 
select name, population, 
avg(population) over () as rata_populasi,
population-avg(population) over () as selisih_populasi
from country
''')

             name  population  rata_populasi selisih_populasi
0           Aruba      103000  25434098.1172   -25331098.1172
1     Afghanistan    22720000  25434098.1172    -2714098.1172
2          Angola    12878000  25434098.1172   -12556098.1172
3        Anguilla        8000  25434098.1172   -25426098.1172
4         Albania     3401200  25434098.1172   -22032898.1172
..            ...         ...            ...              ...
234         Yemen    18112000  25434098.1172    -7322098.1172
235    Yugoslavia    10640000  25434098.1172   -14794098.1172
236  South Africa    40377000  25434098.1172    14942901.8828
237        Zambia     9169000  25434098.1172   -16265098.1172
238      Zimbabwe    11669000  25434098.1172   -13765098.1172

[239 rows x 4 columns]

In [54]:
#group by
sql(''' 
select continent, avg(population) from country
group by continent
''')

       continent avg(population)
0  North America   13053864.8649
1           Asia   72647562.7451
2         Africa   13525431.0345
3         Europe   15871186.9565
4  South America   24698571.4286
5        Oceania    1085755.3571
6     Antarctica          0.0000

In [56]:
# over partition, perhatikan isi kolom rata populasi
sql('''
select name, continent, population,
avg(population) over (partition by continent) as rata_populasi
from country
''')

                     name      continent  population  rata_populasi
0             Afghanistan           Asia    22720000  72647562.7451
1    United Arab Emirates           Asia     2441000  72647562.7451
2                 Armenia           Asia     3520000  72647562.7451
3              Azerbaijan           Asia     7734000  72647562.7451
4              Bangladesh           Asia   129155000  72647562.7451
..                    ...            ...         ...            ...
234                  Peru  South America    25662000  24698571.4286
235              Paraguay  South America     5496000  24698571.4286
236              Suriname  South America      417000  24698571.4286
237               Uruguay  South America     3337000  24698571.4286
238             Venezuela  South America    24170000  24698571.4286

[239 rows x 4 columns]

In [57]:
# mencari selisih populasi suatu negara dengan rata-rata populasi benuanya
sql('''
select name, continent, population,
avg(population) over (partition by continent) as rata_populasi,
population-avg(population) over (partition by continent) as selisih_populasi
from country
''')

,name,continent,population,rata_populasi,selisih_populasi
0,Afghanistan,Asia,22720000,72647562.7451,-49927562.7451
1,United Arab Emirates,Asia,2441000,72647562.7451,-70206562.7451
2,Armenia,Asia,3520000,72647562.7451,-69127562.7451
3,Azerbaijan,Asia,7734000,72647562.7451,-64913562.7451
4,Bangladesh,Asia,129155000,72647562.7451,56507437.2549
...,...,...,...,...,...
234,Peru,South America,25662000,24698571.4286,963428.5714
235,Paraguay,South America,5496000,24698571.4286,-19202571.4286
236,Suriname,South America,417000,24698571.4286,-24281571.4286
237,Uruguay,South America,3337000,24698571.4286,-21361571.4286
238,Venezuela,South America,24170000,24698571.4286,-528571.4286

In [64]:
#row_number() --> membuat kolom baru berisikan index baris
sql('''
select  name, continent, 
ROW_NUMBER() OVER (PARTITION BY CONTINENT) as nomor
from country
''')

                     name      continent  nomor
0             Afghanistan           Asia      1
1    United Arab Emirates           Asia      2
2                 Armenia           Asia      3
3              Azerbaijan           Asia      4
4              Bangladesh           Asia      5
..                    ...            ...    ...
234                  Peru  South America     10
235              Paraguay  South America     11
236              Suriname  South America     12
237               Uruguay  South America     13
238             Venezuela  South America     14

[239 rows x 3 columns]

In [63]:
sql('''
with nomor_baris as(
    select  name, continent, 
    ROW_NUMBER() OVER (PARTITION BY CONTINENT) as nomor
    from country
    )

select * from nomor_baris
where nomor <=3
''')

                           name      continent  nomor
0                   Afghanistan           Asia      1
1          United Arab Emirates           Asia      2
2                       Armenia           Asia      3
3                       Albania         Europe      1
4                       Andorra         Europe      2
5                       Austria         Europe      3
6                         Aruba  North America      1
7                      Anguilla  North America      2
8          Netherlands Antilles  North America      3
9                        Angola         Africa      1
10                      Burundi         Africa      2
11                        Benin         Africa      3
12               American Samoa        Oceania      1
13                    Australia        Oceania      2
14      Cocos (Keeling) Islands        Oceania      3
15                   Antarctica     Antarctica      1
16  French Southern territories     Antarctica      2
17                Bouvet Island     Antarctica      3
18                    Argentina  South America      1
19                      Bolivia  South America      2
20                       Brazil  South America      3

In [68]:
#rank()--> membuat kolom baru berisikan ranking dari baris tersebut berdasarkan kolom tertentu
sql('''
select name, continent, population,
RANK() OVER (ORDER BY POPULATION desc) as rank_pop
from country
''')

,name,continent,population,rank_pop
0,China,Asia,1277558000,1
1,India,Asia,1013662000,2
2,United States,North America,278357000,3
3,Indonesia,Asia,212107000,4
4,Brazil,South America,170115000,5
...,...,...,...,...
234,Bouvet Island,Antarctica,0,233
235,Heard Island and McDonald Islands,Antarctica,0,233
236,British Indian Ocean Territory,Africa,0,233
237,South Georgia and the South Sandwich Islands,Antarctica,0,233
238,United States Minor Outlying Islands,Oceania,0,233

In [73]:
#rank dengan group by
sql('''
select continent, count(*) as jumlah_negara, avg(population),
rank() over(order by avg(population) desc) as rank_pop,
rank() over(order by count(*) desc) as rank_total
from country
group by 1
order by 4
''')

       continent  jumlah_negara avg(population)  rank_pop  rank_total
0           Asia             51   72647562.7451         1           2
1  South America             14   24698571.4286         2           6
2         Europe             46   15871186.9565         3           3
3         Africa             58   13525431.0345         4           1
4  North America             37   13053864.8649         5           4
5        Oceania             28    1085755.3571         6           5
6     Antarctica              5          0.0000         7           7

In [80]:
#ntile --> membuat baris berisikan nomor yg nomor group sesuai dengan jumlah group yg kita tentukan. Pembagian didasarkan pada urutan nilai data. misal ada 20 data, kita bagi 4, maka 5 data dengan nilai terkecil (secara default dari kecil-besar) akan masuk ke grup 1, 5 data berikutnya grup 2, dan 5 data dengan nilai terbesar di grup 4.

sql('''
with quantile as(
select name, population,
ntile(4) over(order by population desc) as quantile_pop
from country)
select * from quantile where quantile_pop=1
''')

                                     name  population  quantile_pop
0                                   China  1277558000             1
1                                   India  1013662000             1
2                           United States   278357000             1
3                               Indonesia   212107000             1
4                                  Brazil   170115000             1
5                                Pakistan   156483000             1
6                      Russian Federation   146934000             1
7                              Bangladesh   129155000             1
8                                   Japan   126714000             1
9                                 Nigeria   111506000             1
10                                 Mexico    98881000             1
11                                Germany    82164700             1
12                                Vietnam    79832000             1
13                            Philippines    75967000             1
14                                  Egypt    68470000             1
15                                   Iran    67702000             1
16                                 Turkey    66591000             1
17                               Ethiopia    62565000             1
18                               Thailand    61399000             1
19                         United Kingdom    59623400             1
20                                 France    59225700             1
21                                  Italy    57680000             1
22  Congo, The Democratic Republic of the    51654000             1
23                                Ukraine    50456000             1
24                            South Korea    46844000             1
25                                Myanmar    45611000             1
26                               Colombia    42321000             1
27                           South Africa    40377000             1
28                                  Spain    39441700             1
29                                 Poland    38653600             1
30                              Argentina    37032000             1
31                               Tanzania    33517000             1
32                                Algeria    31471000             1
33                                 Canada    31147000             1
34                                  Kenya    30080000             1
35                                  Sudan    29490000             1
36                                Morocco    28351000             1
37                                   Peru    25662000             1
38                             Uzbekistan    24318000             1
39                              Venezuela    24170000             1
40                            North Korea    24039000             1
41                                  Nepal    23930000             1
42                                   Iraq    23115000             1
43                            Afghanistan    22720000             1
44                                Romania    22455500             1
45                                 Taiwan    22256000             1
46                               Malaysia    22244000             1
47                                 Uganda    21778000             1
48                           Saudi Arabia    21607000             1
49                                  Ghana    20212000             1
50                             Mozambique    19680000             1
51                              Australia    18886000             1
52                              Sri Lanka    18827000             1
53                                  Yemen    18112000             1
54                              Kazakstan    16223000             1
55                                  Syria    16125000             1
56                             Madagascar    15942000             1
57                            Netherlands    15864000             1
58                                  Chile    15211000             1
59                               Cameroon    15085000             1

In [108]:
# sliding windows, untuk mencari aggregate dari beberapa data berurutan. biasanya dipakai untuk mencari moving average atau jumlah kumulatif
sql('''
with total_negara_per_benua as(
    select continent, count(*) as total_negara from country
    group by 1
)
select continent, total_negara,
sum(total_negara) over (order by total_negara desc 
ROWS BETWEEN UNBOUNDED PRECEDING and CURRENT ROW) as total_cumulatif
from total_negara_per_benua
 ''')

       continent  total_negara total_cumulatif
0         Africa            58              58
1           Asia            51             109
2         Europe            46             155
3  North America            37             192
4        Oceania            28             220
5  South America            14             234
6     Antarctica             5             239

In [110]:
#untuk penggunakan preceding dan following, perlu dicantumkan berapa baris setelah/sebelum
# di contoh ini, kita menjumlahkan total negara tiap baris dengan 1 baris setelahnya
sql('''
with total_negara_per_benua as(
    select continent, count(*) as total_negara from country
    group by 1
)
select continent, total_negara,
sum(total_negara) over (order by total_negara desc 
ROWS BETWEEN CURRENT ROW and 1 FOLLOWING) as total_cumulatif
from total_negara_per_benua
 ''')

       continent  total_negara total_cumulatif
0         Africa            58             109
1           Asia            51              97
2         Europe            46              83
3  North America            37              65
4        Oceania            28              42
5  South America            14              19
6     Antarctica             5               5